## Merging, Joining, and Concatenating DataFrames

1-The `pd.concat()` Method, Part 1 (with ignore_index)

2-The `pd.concat()` Method, Part 2 (with keys) 

3-Inner Joins, Part 1

4-Inner Joins, Part 2

5-Outer Joins

6-Left Joins

7-The `left_on` and `right_on` Parameters

8-Merging by Indexes with the `left_index` and `right_index` Parameters

9-The `.join()` Method

10-The `pd.merge()` Method

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [1]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore", category=FutureWarning)

In [2]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv")
foods = pd.read_csv("files/Restaurant - Foods.csv")

#### The pd.concat() Method, Part 1

Week 1 and week 2 have same columns. (Customer ID, Food ID) We can concat these two dataframe with pd.concat().

In [3]:
pd.concat(objs = [week1,week2]) # there are two same index numbers. 
pd.concat(objs = [week1,week2], ignore_index = True).head() # it'll create new index numbers

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

##### Other way to concat:

This always creates a new data frame so if you want to keep it you need to sign it to a variable either a new variable or overwriting an original one. If you want to for example lose week one or week two.

In [4]:
week1.append(other = week2, ignore_index = True).head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

#### The pd.concat() Method, Part 2

In [5]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv")
foods = pd.read_csv("files/Restaurant - Foods.csv")

What if I wanted a unique identifier for each row here. But I also didn't want to lose my original index positions so you might think how is that possible.

In [6]:
# this concats them but shows separetly. 

sales = pd.concat(objs = [week1,week2], keys = ["Week 1","Week 2"])
sales.head()

          Customer ID  Food ID
Week 1 0          537        9
       1           97        4
       2          658        1
       3          202        2
       4          155        9

In [7]:
sales.loc[("Week 1",)] #it shows just Week 1 entirely.  
sales.loc[("Week 2",)].head() #it shows just Week 2 entirely.

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [8]:
sales.loc[("Week 1",240)] #it shows just 240th value of Week 1.  
sales.loc[("Week 2",125)] #it shows just 125th value of Week 2.

Customer ID    816
Food ID          2
Name: (Week 2, 125), dtype: int64

In [9]:
sales.loc[("Week 2",125),"Customer ID"] #it shows just 125th Customer ID value of Week 2.  
sales.loc[("Week 1",240),"Customer ID"] #it shows just 240th Customer ID value of Week 1.

945

#### Inner Joins, Part 1

In [10]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv")
foods = pd.read_csv("files/Restaurant - Foods.csv")

In [11]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [12]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [13]:
week1.merge(week2, how = "inner", on = "Customer ID", suffixes = [" - Week 1", " -Week 2"]).head()

# suffixes is for giving to new name after the column names.

   Customer ID  Food ID - Week 1  Food ID -Week 2
0          537                 9                5
1          155                 9                3
2          155                 1                3
3          503                 5                8
4          503                 5                9

In [14]:
week1[week1["Customer ID"] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [15]:
week2[week2["Customer ID"] == 155]

     Customer ID  Food ID
208          155        3

#### Inner Joins, Part 2

In [16]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv")
foods = pd.read_csv("files/Restaurant - Foods.csv")

In [17]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [18]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [19]:
week1.merge(week2,how = "inner", on = ["Customer ID","Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [20]:
week1[week1["Customer ID"] == 578]

     Customer ID  Food ID
224          578        5

In [22]:
week2[week2["Customer ID"] == 578]

     Customer ID  Food ID
29           578        5
189          578        5

#### Outer Joins

In [23]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv")
foods = pd.read_csv("files/Restaurant - Foods.csv")

In [24]:
merged = week1.merge(week2, how = "outer", on = "Customer ID", suffixes = [" - Week 1", " - Week 2"],
            indicator = True)

In [25]:
merged.head()

   Customer ID  Food ID - Week 1  Food ID - Week 2     _merge
0          537               9.0               5.0       both
1           97               4.0               NaN  left_only
2          658               1.0               NaN  left_only
3          202               2.0               NaN  left_only
4          155               9.0               3.0       both

In [26]:
merged["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [29]:
mask = merged["_merge"].isin(["left_only","right_only"])
merged[mask].head()

   Customer ID  Food ID - Week 1  Food ID - Week 2     _merge
1           97               4.0               NaN  left_only
2          658               1.0               NaN  left_only
3          202               2.0               NaN  left_only
6          213               8.0               NaN  left_only
7          600               1.0               NaN  left_only

#### Left Joins

In [30]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv")
foods = pd.read_csv("files/Restaurant - Foods.csv")

In [31]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [32]:
foods.head(2)

   Food ID Food Item  Price
0        1     Sushi   3.99
1        2   Burrito   9.99

In [33]:
week1 = week1.merge(foods, how = "left", on = "Food ID", sort = True)

In [38]:
week1.head()

   Customer ID  Food ID Food Item  Price
0          658        1     Sushi   3.99
1          600        1     Sushi   3.99
2          155        1     Sushi   3.99
3          341        1     Sushi   3.99
4           20        1     Sushi   3.99

#### The left_on and right_on Parameters

In [39]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv")
foods = pd.read_csv("files/Restaurant - Foods.csv")

In [40]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [41]:
customers.head(2)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer

In [42]:
week2 = week2.merge(customers, how = "left", left_on = "Customer ID", 
                    right_on = "ID", sort = True).drop("ID", axis = "columns")

In [43]:
week2.head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,8,6,Frances,Adams,Female,Dabshots,Developer III
1,13,2,Ruth,Alvarez,Female,Twitterlist,Mechanical Systems Engineer
2,21,4,Albert,Burns,Male,Rhynoodle,Junior Executive
3,24,8,Donna,Thomas,Female,Jaxbean,Chief Design Engineer
4,27,4,Jessica,Bennett,Female,Twitternation,Account Executive

#### Merging by Indexes with the left_index and right_index Parameters

In [45]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv", index_col = "ID")
foods = pd.read_csv("files/Restaurant - Foods.csv", index_col = "Food ID")

In [46]:
foods.head(2)

        Food Item  Price
Food ID
1           Sushi   3.99
2         Burrito   9.99

In [47]:
customers.head(2)

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer

In [50]:
sales = week1.merge(customers, how = "left", left_on = "Customer ID", right_index = True)
sales = sales.merge(foods, how = "left", left_on = "Food ID", right_index = True)
sales.head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99

In [51]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [52]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [65]:
# to join as index:
 
week1.merge(week2, how = "left", left_index = True, right_index = True, 
            suffixes = [" - Week 1", " - Week 2"]).head()

,Customer ID - Week 1,Food ID - Week 1,Customer ID - Week 2,Food ID - Week 2
0,537,9,688,10
1,97,4,813,7
2,658,1,495,10
3,202,2,189,5
4,155,9,267,3

#### The .join() Method

In [55]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv")
foods = pd.read_csv("files/Restaurant - Foods.csv")
satisfaction = pd.read_csv("files/Restaurant - Week 1 Satisfaction.csv")

In [56]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [57]:
satisfaction.head(2)

   Satisfaction Rating
0                    2
1                    7

In [58]:
week1.merge(satisfaction, how = "left", left_index = True, right_index = True).head()

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3
3          202        2                    7
4          155        9                   10

In [59]:
week1.join(satisfaction).head()

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3
3          202        2                    7
4          155        9                   10

#### The pd.merge() Method

In [60]:
week1 = pd.read_csv("files/Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("files/Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("files/Restaurant - Customers.csv")
foods = pd.read_csv("files/Restaurant - Foods.csv")
satisfaction = pd.read_csv("files/Restaurant - Week 1 Satisfaction.csv")

In [61]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [62]:
customers.head(2)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer

In [64]:
pd.merge(week1, customers, how = "left", left_on = "Customer ID", right_on = "ID").head()

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,537,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,97,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,658,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,202,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,155,Carolyn,Diaz,Female,Gigazoom,Database Administrator III